In [1]:
import pandas as pd
import numpy as np
%matplotlib inline

titanic = pd.read_csv('http://bit.ly/kaggletrain')
orders = pd.read_csv('http://bit.ly/chiporders', sep='\t')
orders['item_price'] = orders.item_price.str.replace('$','').astype('float')
stocks = pd.read_csv('http://bit.ly/smallstocks')
ufo = pd.read_csv('http://bit.ly/uforeports', parse_dates=['Time'])
movies = pd.read_csv('http://bit.ly/imdbratings')
drinks = pd.read_csv('http://bit.ly/drinksbycountry')

### **1. Show installed versions**

In [2]:
pd.__version__

'0.24.2'

In [3]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit: None
python: 3.7.3.final.0
python-bits: 64
OS: Windows
OS-release: 7
machine: AMD64
processor: Intel64 Family 6 Model 42 Stepping 7, GenuineIntel
byteorder: little
LC_ALL: None
LANG: None
LOCALE: None.None

pandas: 0.24.2
pytest: 4.3.1
pip: 19.0.3
setuptools: 40.8.0
Cython: 0.29.6
numpy: 1.16.2
scipy: 1.2.1
pyarrow: None
xarray: None
IPython: 7.4.0
sphinx: 1.8.5
patsy: 0.5.1
dateutil: 2.8.0
pytz: 2018.9
blosc: None
bottleneck: 1.2.1
tables: 3.5.1
numexpr: 2.6.9
feather: None
matplotlib: 3.0.3
openpyxl: 2.6.1
xlrd: 1.2.0
xlwt: 1.3.0
xlsxwriter: 1.1.5
lxml.etree: 4.3.2
bs4: 4.7.1
html5lib: 1.0.1
sqlalchemy: 1.3.1
pymysql: None
psycopg2: None
jinja2: 2.10
s3fs: None
fastparquet: None
pandas_gbq: None
pandas_datareader: 0.7.0
gcsfs: None

## **2.Create an example DataFrame**

In [4]:
df = pd.DataFrame({'col one':[100,200], 'col two':[300,400]})
df

   col one  col two
0      100      300
1      200      400

In [5]:
pd.DataFrame(np.random.rand(4,8))

,0,1,2,3,4,5,6,7
0,0.639587,0.067002,0.604777,0.096913,0.521641,0.807569,0.410572,0.066305
1,0.896897,0.028521,0.947154,0.629385,0.121277,0.139044,0.964404,0.511456
2,0.178180,0.297604,0.897754,0.985314,0.409369,0.054380,0.328831,0.577652
3,0.037722,0.754724,0.078686,0.451609,0.584206,0.809919,0.149566,0.111469

In [6]:
pd. DataFrame(np.random.rand(4,8),columns=list('abcdefgh'))

,a,b,c,d,e,f,g,h
0,0.593297,0.944469,0.596928,0.342746,0.051290,0.459629,0.105128,0.322868
1,0.935598,0.949543,0.686905,0.120443,0.929389,0.936304,0.367750,0.728790
2,0.939790,0.917257,0.953684,0.274971,0.369672,0.355807,0.693636,0.101310
3,0.149066,0.127789,0.712442,0.582363,0.309572,0.658484,0.864351,0.988279

## **3.Rename columns**

In [7]:
df

   col one  col two
0      100      300
1      200      400

In [8]:
df = df.rename({'col one':'col_one', 'col two':'col_two'}, axis='columns')

In [9]:
df

   col_one  col_two
0      100      300
1      200      400

In [10]:
df.columns = df.columns.str.replace(' ', '_')

In [11]:
df

   col_one  col_two
0      100      300
1      200      400

In [12]:
df.add_prefix('X_')

   X_col_one  X_col_two
0        100        300
1        200        400

In [13]:
df.add_suffix('_Y')

   col_one_Y  col_two_Y
0        100        300
1        200        400

## **4. Reverse row order**

In [14]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [15]:
drinks.loc[::-1].head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
192,Zimbabwe,64,18,4,4.7,Africa
191,Zambia,32,19,4,2.5,Africa
190,Yemen,6,0,0,0.1,Asia
189,Vietnam,111,2,1,2.0,Asia
188,Venezuela,333,100,3,7.7,South America

In [16]:
drinks.loc[::-1].reset_index(drop=True).head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Zimbabwe,64,18,4,4.7,Africa
1,Zambia,32,19,4,2.5,Africa
2,Yemen,6,0,0,0.1,Asia
3,Vietnam,111,2,1,2.0,Asia
4,Venezuela,333,100,3,7.7,South America

## **5. Reverce column order**

In [17]:
drinks.loc[:,::-1].head()

,continent,total_litres_of_pure_alcohol,wine_servings,spirit_servings,beer_servings,country
0,Asia,0.0,0,0,0,Afghanistan
1,Europe,4.9,54,132,89,Albania
2,Africa,0.7,14,0,25,Algeria
3,Europe,12.4,312,138,245,Andorra
4,Africa,5.9,45,57,217,Angola

## **6. Select columns by data type**

In [18]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [19]:
drinks.select_dtypes(include='number').head()

   beer_servings  spirit_servings  wine_servings  total_litres_of_pure_alcohol
0              0                0              0                           0.0
1             89              132             54                           4.9
2             25                0             14                           0.7
3            245              138            312                          12.4
4            217               57             45                           5.9

In [20]:
drinks.select_dtypes(include='object').head()

       country continent
0  Afghanistan      Asia
1      Albania    Europe
2      Algeria    Africa
3      Andorra    Europe
4       Angola    Africa

In [21]:
drinks.select_dtypes(include=['number', 'object', 'category', 'datetime']).head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [22]:
drinks.select_dtypes(exclude='number').head()

       country continent
0  Afghanistan      Asia
1      Albania    Europe
2      Algeria    Africa
3      Andorra    Europe
4       Angola    Africa

## **7. Convert strings to numbers**

In [23]:
df = pd.DataFrame({'col_one':['1.1','2.2','3.3'],
                   'col_two':['4.4','5.5','6.6'], 
                   'col_three':['7.7','8.8','-']})
df

  col_one col_two col_three
0     1.1     4.4       7.7
1     2.2     5.5       8.8
2     3.3     6.6         -

In [24]:
df.dtypes

col_one      object
col_two      object
col_three    object
dtype: object

In [25]:
df.astype({'col_one':'float', 'col_two': 'float'}).dtypes

col_one      float64
col_two      float64
col_three     object
dtype: object

In [26]:
pd.to_numeric(df.col_three, errors='coerce')

0    7.7
1    8.8
2    NaN
Name: col_three, dtype: float64

In [27]:
pd.apply(df.col_three, errors='coerce').fillna(0)

AttributeError: module 'pandas' has no attribute 'apply'

In [ ]:
df = pd.to_numeric(df.col_three, errors='coerce').fillna(0)

In [ ]:
df.dtypes

## **8. Reduce DataFrame size**

In [ ]:
drinks.info(memory_usage='deep')

In [ ]:
cols = ['beer_servings', 'continent']
small_drinks = pd.read_csv('http://bit.ly/drinksbycountry', usecols=cols)
small_drinks.info(memory_usage='deep')

In [ ]:
dtypes = {'continent': 'category'}
small_drinks = pd.read_csv('http://bit.ly/drinksbycountry', usecols=cols, dtype=dtypes)
small_drinks.info(memory_usage='deep')

## **9. Build a DataFrame from multiple files(row-wise)**

In [ ]:
stocks = pd.read_csv('http://bit.ly/smallstocks')

In [28]:
pd.read_csv('stocks1.csv')

   Unnamed: 0        Date   Close    Volume Symbol
0           0  2016-10-03   31.50  14070500   CSCO
1           1  2016-10-03  112.52  21701800   AAPL
2           2  2016-10-03   57.42  19189500   MSFT

In [29]:
pd.read_csv('stocks2.csv')

   Unnamed: 0        Date   Close    Volume Symbol
0           0  2016-10-04  113.00  29736800   AAPL
1           1  2016-10-04   57.24  20085900   MSFT
2           2  2016-10-04   31.35  18460400   CSCO

In [30]:
pd.read_csv('stocks3.csv')

   Unnamed: 0        Date   Close    Volume Symbol
0           0  2016-10-05   57.64  16726400   MSFT
1           1  2016-10-05   31.59  11808600   CSCO
2           2  2016-10-05  113.05  21453100   AAPL

In [31]:
from glob import glob

In [33]:
stock_files = sorted(glob('stock*.csv'))
stock_files

['stocks1.csv', 'stocks2.csv', 'stocks3.csv']

In [34]:
pd.concat((pd.read_csv(file) for file in stock_files))

   Unnamed: 0        Date   Close    Volume Symbol
0           0  2016-10-03   31.50  14070500   CSCO
1           1  2016-10-03  112.52  21701800   AAPL
2           2  2016-10-03   57.42  19189500   MSFT
0           0  2016-10-04  113.00  29736800   AAPL
1           1  2016-10-04   57.24  20085900   MSFT
2           2  2016-10-04   31.35  18460400   CSCO
0           0  2016-10-05   57.64  16726400   MSFT
1           1  2016-10-05   31.59  11808600   CSCO
2           2  2016-10-05  113.05  21453100   AAPL

In [35]:
#because of this wrong index need to ignore
pd.concat((pd.read_csv(file) for file in stock_files), ignore_index=True)

   Unnamed: 0        Date   Close    Volume Symbol
0           0  2016-10-03   31.50  14070500   CSCO
1           1  2016-10-03  112.52  21701800   AAPL
2           2  2016-10-03   57.42  19189500   MSFT
3           0  2016-10-04  113.00  29736800   AAPL
4           1  2016-10-04   57.24  20085900   MSFT
5           2  2016-10-04   31.35  18460400   CSCO
6           0  2016-10-05   57.64  16726400   MSFT
7           1  2016-10-05   31.59  11808600   CSCO
8           2  2016-10-05  113.05  21453100   AAPL

## **10. Build a DataFrame from multiple files(column-wise)**

In [37]:
pd.read_csv('drinks1.csv').head()

   Unnamed: 0      country  beer_servings  spirit_servings
0           0  Afghanistan              0                0
1           1      Albania             89              132
2           2      Algeria             25                0
3           3      Andorra            245              138
4           4       Angola            217               57

In [38]:
pd.read_csv('drinks2.csv').head()

   Unnamed: 0  wine_servings  total_litres_of_pure_alcohol continent
0           0              0                           0.0      Asia
1           1             54                           4.9    Europe
2           2             14                           0.7    Africa
3           3            312                          12.4    Europe
4           4             45                           5.9    Africa

In [39]:
drinks_files = sorted(glob('drinks*.csv'))

In [46]:
pd.concat((pd.read_csv(file, index_col=0) for file in drinks_files), axis='columns').head()

,country,beer_servings,spirit_servings,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,Angola,217,57,45,5.9,Africa

## **11. Create a DataFrame from a clipboard**

In [50]:
#https://pl.wikipedia.org/wiki/Korona_G%C3%B3r_Polski
mountains_df = pd.read_clipboard()

In [51]:
mountains_df.head()

,Lp.,Szczyt,Pasmo grskie,Wysoko (m n.p.m.)
0,1,Rysy (wierzchoek graniczny),Tatry,2499
1,2,Babia Gra (wierzchoek graniczny),Beskid ywiecki,1725
2,3,nieka (wierzchoek graniczny),Karkonosze,1603
3,4,nienik (wierzchoek graniczny),Masyw nienika,1425
4,5,Tarnica,Bieszczady Zachodnie,1346

In [54]:
mountains_df.dtypes

Lp.                     int64
Szczyt                 object
Pasmo grskie          object
Wysoko (m n.p.m.)     int64
dtype: object

In [55]:
mountains_df.index

RangeIndex(start=0, stop=28, step=1)

## **12. Split a DataFrame into two random subsets**

In [56]:
len(movies)

979

In [58]:
movies1 = movies.sample(frac=0.75, random_state=1234)

In [59]:
movies2 = movies.drop(movies1.index)

In [60]:
len(movies1) + len(movies2)

979

In [61]:
movies1.head()

,star_rating,title,content_rating,genre,duration,actors_list
387,8.0,Midnight Cowboy,X,Drama,113,"[u'Dustin Hoffman', u'Jon Voight', u'Sylvia Mi..."
653,7.7,Fearless,PG-13,Action,104,"[u'Jet Li', u'Li Sun', u'Yong Dong']"
40,8.5,The Green Mile,R,Crime,189,"[u'Tom Hanks', u'Michael Clarke Duncan', u'Dav..."
913,7.5,Suspiria,X,Horror,92,"[u'Jessica Harper', u'Stefania Casini', u'Flav..."
766,7.6,The Little Mermaid,G,Animation,83,"[u'Jodi Benson', u'Samuel E. Wright', u'Rene A..."

In [62]:
movies2.head()

,star_rating,title,content_rating,genre,duration,actors_list
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."
10,8.8,The Lord of the Rings: The Fellowship of the Ring,PG-13,Adventure,178,"[u'Elijah Wood', u'Ian McKellen', u'Orlando Bl..."
12,8.8,Star Wars: Episode V - The Empire Strikes Back,PG,Action,124,"[u'Mark Hamill', u'Harrison Ford', u'Carrie Fi..."

In [64]:
movies1.index.sort_values()

Int64Index([  0,   2,   5,   6,   7,   8,   9,  11,  13,  16,
            ...
            966, 967, 969, 971, 972, 974, 975, 976, 977, 978],
           dtype='int64', length=734)

In [65]:
movies2.index.sort_values()

Int64Index([  1,   3,   4,  10,  12,  14,  15,  18,  26,  30,
            ...
            931, 934, 937, 941, 950, 954, 960, 968, 970, 973],
           dtype='int64', length=245)

## **13. Filter a DataFrame by multiple categories**

In [66]:
movies.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [67]:
movies.genre.unique()

array(['Crime', 'Action', 'Drama', 'Western', 'Adventure', 'Biography',
       'Comedy', 'Animation', 'Mystery', 'Horror', 'Film-Noir', 'Sci-Fi',
       'History', 'Thriller', 'Family', 'Fantasy'], dtype=object)

In [68]:
movies[(movies.genre == 'Action') | (movies.genre == 'Drama') | (movies.genre == 'Western')].head()

,star_rating,title,content_rating,genre,duration,actors_list
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
5,8.9,12 Angry Men,NOT RATED,Drama,96,"[u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals..."
6,8.9,"The Good, the Bad and the Ugly",NOT RATED,Western,161,"[u'Clint Eastwood', u'Eli Wallach', u'Lee Van ..."
9,8.9,Fight Club,R,Drama,139,"[u'Brad Pitt', u'Edward Norton', u'Helena Bonh..."
11,8.8,Inception,PG-13,Action,148,"[u'Leonardo DiCaprio', u'Joseph Gordon-Levitt'..."

In [70]:
movies[movies.genre.isin(['Action','Drame', 'Western'])].head()

,star_rating,title,content_rating,genre,duration,actors_list
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
6,8.9,"The Good, the Bad and the Ugly",NOT RATED,Western,161,"[u'Clint Eastwood', u'Eli Wallach', u'Lee Van ..."
11,8.8,Inception,PG-13,Action,148,"[u'Leonardo DiCaprio', u'Joseph Gordon-Levitt'..."
12,8.8,Star Wars: Episode V - The Empire Strikes Back,PG,Action,124,"[u'Mark Hamill', u'Harrison Ford', u'Carrie Fi..."
19,8.7,Star Wars,PG,Action,121,"[u'Mark Hamill', u'Harrison Ford', u'Carrie Fi..."

In [72]:
# '~' - operator not
movies[~movies.genre.isin(['Action','Drame', 'Western'])].head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."
5,8.9,12 Angry Men,NOT RATED,Drama,96,"[u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals..."

## **14. Filter a DataFrame by largest categories**

In [74]:
counts = movies.genre.value_counts()
counts

Drama        278
Comedy       156
Action       136
Crime        124
Biography     77
Adventure     75
Animation     62
Horror        29
Mystery       16
Western        9
Thriller       5
Sci-Fi         5
Film-Noir      3
Family         2
Fantasy        1
History        1
Name: genre, dtype: int64

In [75]:
counts.nlargest(3)

Drama     278
Comedy    156
Action    136
Name: genre, dtype: int64

In [76]:
counts.nlargest(3).index

Index(['Drama', 'Comedy', 'Action'], dtype='object')

In [77]:
movies[movies.genre.isin(counts.nlargest(3).index)].head()

,star_rating,title,content_rating,genre,duration,actors_list
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
5,8.9,12 Angry Men,NOT RATED,Drama,96,"[u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals..."
9,8.9,Fight Club,R,Drama,139,"[u'Brad Pitt', u'Edward Norton', u'Helena Bonh..."
11,8.8,Inception,PG-13,Action,148,"[u'Leonardo DiCaprio', u'Joseph Gordon-Levitt'..."
12,8.8,Star Wars: Episode V - The Empire Strikes Back,PG,Action,124,"[u'Mark Hamill', u'Harrison Ford', u'Carrie Fi..."

## **15. Handle missing values**

In [78]:
ufo.head()

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00

In [79]:
ufo.isna().sum()

City                  25
Colors Reported    15359
Shape Reported      2644
State                  0
Time                   0
dtype: int64

In [80]:
ufo.isna().mean()

City               0.001371
Colors Reported    0.842004
Shape Reported     0.144948
State              0.000000
Time               0.000000
dtype: float64

In [84]:
#drop columns where more at least one valueis missing
ufo.dropna(axis='columns').head()

  State                Time
0    NY 1930-06-01 22:00:00
1    NJ 1930-06-30 20:00:00
2    CO 1931-02-15 14:00:00
3    KS 1931-06-01 13:00:00
4    NY 1933-04-18 19:00:00

In [85]:
# drop column if more than 10% value is missing
ufo.dropna(thresh=len(ufo)*0.9, axis='columns').head()

                   City State                Time
0                Ithaca    NY 1930-06-01 22:00:00
1           Willingboro    NJ 1930-06-30 20:00:00
2               Holyoke    CO 1931-02-15 14:00:00
3               Abilene    KS 1931-06-01 13:00:00
4  New York Worlds Fair    NY 1933-04-18 19:00:00

## **16. Split a string into multiple columns**

In [87]:
df = pd.DataFrame({'name':['John Arthur Doe', 'Jane Ann Smith'],
                   'location':['Los Angeles, CA','Washington, DC']})
df

              name         location
0  John Arthur Doe  Los Angeles, CA
1   Jane Ann Smith   Washington, DC

In [90]:
df.name.str.split(' ', expand=True)

      0       1      2
0  John  Arthur    Doe
1  Jane     Ann  Smith

In [92]:
df[['first','middle','last']] = df.name.str.split(' ',expand=True)
df

              name         location first  middle   last
0  John Arthur Doe  Los Angeles, CA  John  Arthur    Doe
1   Jane Ann Smith   Washington, DC  Jane     Ann  Smith

In [93]:
df.location.str.split(', ', expand=True)

             0   1
0  Los Angeles  CA
1   Washington  DC

In [94]:
df['city'] = df.location.str.split(', ', expand=True)[0]

In [95]:
df

              name         location first  middle   last         city
0  John Arthur Doe  Los Angeles, CA  John  Arthur    Doe  Los Angeles
1   Jane Ann Smith   Washington, DC  Jane     Ann  Smith   Washington

## **17. Expand a Series of lists into a DataFrame**

In [98]:
df = pd.DataFrame({'col_one':['a','b','c'], 'col_two':[[10,40],[20,50],[30,60]]})

In [99]:
df

  col_one   col_two
0       a  [10, 40]
1       b  [20, 50]
2       c  [30, 60]

In [102]:
df_new = df.col_two.apply(pd.Series)
df_new.columns = ['one','two']
df_new

   one  two
0   10   40
1   20   50
2   30   60

In [103]:
pd.concat([df,df_new],axis='columns')

  col_one   col_two  one  two
0       a  [10, 40]   10   40
1       b  [20, 50]   20   50
2       c  [30, 60]   30   60

## **18. Aggregate with multiple functions**

In [104]:
orders.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

In [105]:
orders[orders.order_id == 1].item_price.sum()

11.56

In [106]:
orders.groupby('order_id').item_price.sum().head()

order_id
1    11.56
2    16.98
3    12.67
4    21.00
5    13.70
Name: item_price, dtype: float64

In [109]:
#sum of order, count of item in order
orders.groupby('order_id').item_price.agg(['sum','count']).head()

            sum  count
order_id
1         11.56      4
2         16.98      1
3         12.67      2
4         21.00      2
5         13.70      2

## **19. Combine the output of an aggregation with a DataFrame**

In [112]:
orders.head(5)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

In [113]:
orders.groupby('order_id').item_price.sum().head()

order_id
1    11.56
2    16.98
3    12.67
4    21.00
5    13.70
Name: item_price, dtype: float64

In [115]:
len(orders.groupby('order_id').item_price.sum())

1834

In [ ]:
## **17. Expand a Series of lists into a DataFrame**